app/controllers/alunos_controller.rb

    def nome_classe
           @classe = Classe.find(:all, :joins => "inner join alunos_classes on classes.id = alunos_classes.classe_id", :conditions =>['alunos_classes.aluno_id =?', params[:aluno_aluno_id]])
---
SELECT * FROM `alunos` WHERE (`alunos`.`id` = 9133)
SELECT `classes`.* FROM `classes` inner join matriculas on classes.id = matriculas.classe_id WHERE (matriculas.aluno_id ='9133')

  def load_alunos


    if (current_user.unidade_id == 53 or current_user.unidade_id == 52) then

        @alunos =  Aluno.find(:all,:order => "aluno_nome")
        @alunosRA =  Aluno.find(:all,:order => "aluno_ra")
        @alunosRM =  Aluno.find(:all,:order => "aluno_rm")
        @alunos1 = Aluno.find(:all, :conditions => ['unidade_id =?',current_user.unidade_id],:order => 'aluno_nome ASC' )
---
SELECT id, aluno_nome, aluno_rm, unidade_id FROM `alunos` WHERE (unidade_id = 4 AND aluno_status is null) ORDER BY aluno_rm
SELECT * FROM `unidades` WHERE (`unidades`.`id` = 29)