app/controllers/alunos_controller.rb

    def nome_classe
        session[:de_para]= 0
        @classe = Classe.find(:all, :joins => "inner join matriculas on classes.id = matriculas.classe_id", :conditions =>['matriculas.aluno_id =?', params[:aluno_aluno_id]])
        if @classe.empty?
            @classe = Classe.find(:all, :joins => "inner join matriculas on classes.id = matriculas.classe_id", :conditions =>['matriculas.aluno_id =?', params[:aluno_aluno_id]])
            session[:de_para]=1
        end

        @aluno = Aluno.find(:all, :conditions => ['id =?', params[:aluno_aluno_id]])
        @saude = Saude.find(:all,:conditions =>['aluno_id = ?', params[:aluno_aluno_id]])
        @socioeconomico = Socioeconomico.find(:all,:conditions =>['aluno_id = ?', params[:aluno_aluno_id]])
---
SELECT * FROM `matriculas` WHERE (aluno_id ='9133')
SELECT * FROM `saudes` WHERE (aluno_id = '9133')
SELECT * FROM `socioeconomicos` WHERE (aluno_id = '9133')