app/controllers/atendimento_aees_controller.rb

SELECT * FROM `atendimento_aees` WHERE (`atendimento_aees`.`id` = 11)
---
  def show
    @atendimento_aee = AtendimentoAee.find(params[:id])

INSERT INTO `atendimento_aees` (`classe_num`, `status`, `aluno_id`, `obs`, `created_at`, `unidade_id`, `classe_mat`, `ano_letivo`, `updated_at`, `atendimento`, `classe_id`) VALUES(NULL, NULL, NULL, 'vvvvvvvvvvvvvvvvvvvvv', '2021-07-14 18:31:49', 9, NULL, NULL, '2021-07-14 18:31:49', 'vvvvvvvvvvvvvvv', 3725)
SELECT * FROM `atendimento_aees` WHERE (classe_id =3725 AND ano_letivo=2021 )
UPDATE `atendimento_aees` SET `aluno_id` = 29083, `updated_at` = '2021-07-14 18:37:28', `ano_letivo` = 2021, `classe_mat` = 'MM A' WHERE `id` = 16
---
  def create
    @atendimento_aee = AtendimentoAee.new(params[:atendimento_aee])
    classe_num = 0
    respond_to do |format|
      if @atendimento_aee.save
          @atendimento_aee.classe_mat= session[:cclasse_id]
         wq= @atendimento_aee.aluno_id  = session[:aaluno_id]
         t=0
         # @atendimento_aee.unidade  = session[:uunidade]
          @atendimento_aee.ano_letivo = Time.now.year
          @atendimento_aee.save
        flash[:notice] = 'Atendimento AEE Cadastrado.'
           classe_num = (AtendimentoAee.find(:all, :conditions => ['classe_id =? AND ano_letivo=? ',   @atendimento_aee.classe_id, Time.now.year ]).count)
           if  classe_num == 1
             @atendimento_aee.classe_num = classe_num = 1

           else
              @atendimento_aee.classe_num = classe_num

         end
           @atendimento_aee.save

SELECT * FROM `matriculas` WHERE (aluno_id = NULL AND (status ='MATRICULADO' OR status ='TRANSFERENCIA') AND ano_letivo =2021)
---
  def aluno_classe
        w5 = session[:aaluno_id]=params[:relatorio_aluno_id]



      t=0
         @matricula= Matricula.find(:all, :conditions=> ['aluno_id = ? AND (status =? OR status =?) AND ano_letivo =?' , session[:aaluno_id],"MATRICULADO","TRANSFERENCIA", Time.now.year	])