app/controllers/atribuicaos_controller.rb

SELECT * FROM `classes` WHERE ((unidade_id = 50 or unidade_id = 52 )and classe_ano_letivo = 2021 ) ORDER BY classe_classe ASC
SELECT `atribuicaos`.* FROM `atribuicaos` INNER JOIN classes ON classes.id = atribuicaos.classe_id INNER JOIN disciplinas ON disciplinas.id = atribuicaos.disciplina_id WHERE (classe_id = '3204' AND classes.unidade_id =50 AND disciplinas.nao_disciplina != 1) ORDER BY disciplinas.ordem ASC
SELECT id, nome FROM `professors` WHERE (id = 31 AND desligado = 0) ORDER BY nome ASC
SELECT * FROM `disciplinas` WHERE (`disciplinas`.`id` = 1)
SELECT * FROM `unidades` WHERE (`unidades`.`id` = 50)
SELECT `notas`.* FROM `notas` INNER JOIN atribuicaos ON atribuicaos.id = notas.atribuicao_id INNER JOIN disciplinas ON disciplinas.id = atribuicaos.disciplina_id INNER JOIN alunos ON alunos.id = notas.aluno_id WHERE (atribuicaos.classe_id ='3204' AND notas.matricula_id =71610) ORDER BY disciplinas.ordem ASC
SELECT * FROM `alunos` WHERE (`alunos`.`id` = 1934)
SELECT * FROM `matriculas` WHERE (classe_id = '3204') ORDER BY classe_num ASC
---
def mapa_de_classe
       session[:classe_id] = params[:classe][:id]
       @classe = Classe.find(:all,:conditions =>['id = ?', params[:classe][:id]])
       @professor = Professor.find(:all, :joins => [:atribuicaos], :conditions=> ["atribuicaos.classe_id = ? ",  params[:classe][:id]], :order => 'nome')
       @atribuicao_classe = Atribuicao.find(:all,:joins => "INNER JOIN classes ON classes.id = atribuicaos.classe_id INNER JOIN disciplinas ON disciplinas.id = atribuicaos.disciplina_id",:conditions =>['classe_id = ? AND classes.unidade_id =?', params[:classe][:id], current_user.unidade_id],:order =>'disciplinas.ordem ASC')
       @notas = Nota.find(:all, :joins => "INNER JOIN atribuicaos ON atribuicaos.id = notas.atribuicao_id INNER JOIN disciplinas ON disciplinas.id = atribuicaos.disciplina_id", :conditions => ["atribuicaos.classe_id =? AND notas.ativo is null",  params[:classe][:id]],:order =>'disciplinas.ordem ASC')
       @alunos = Aluno.find(:all, :joins => "inner join matriculas on alunos.id = matriculas.aluno_id", :conditions =>['matriculas.classe_id =?', params[:classe][:id]],:order =>' matriculas.classe_num')

SELECT * FROM `disciplinas` WHERE ((id != 27 and id !=26))
SELECT * FROM `unidades` WHERE (id=50)
SELECT id, nome FROM `professors` WHERE (id = 31 AND desligado = 0) ORDER BY nome ASC
---
   def load_classes
   if current_user.unidade_id == 53 or current_user.unidade_id == 52

        @classes = Classe.find(:all, :conditions => ['classe_ano_letivo = ?', Time.now.year], :order => 'classe_classe ASC')
              if current_user.professor_id.nil?
          if current_user.unidade_id < 42 or current_user.unidade_id > 53
             @disciplinas1 = Disciplina.find(:all, :conditions => ["id = 26 or id = 27"])
          else
            @disciplinas1 = Disciplina.find(:all, :conditions => ["id < 26 or id > 27"])
          end

      else
          if current_user.unidade_id < 42 or current_user.unidade_id > 53
              @disciplinas1 = Disciplina.find(:all, :conditions => ["id = 26 or id = 27"])
          else
            @disciplinas1 = Disciplina.find(:all, :conditions => ["id != 27 and id !=26"])
          end
       end
    else
       @classes = Classe.find(:all, :conditions => ['unidade_id = ? and classe_ano_letivo = ?', current_user.unidade_id, Time.now.year], :order => 'classe_classe ASC')