app/controllers/classes_controller.rb

SELECT * FROM `professors` WHERE (`professors`.`id` = 753)
---
  def load_professors
    if current_user.unidade_id == 53 or current_user.unidade_id == 52
        @professors = Professor.find(:all,:conditions =>'desligado = 0', :order => 'nome ASC')