app/controllers/classes_controller.rb

def consulta_classe_aluno

       session[:classe_id]=params[:classe][:id]
       @classe = Classe.find(:all,:conditions =>['id = ?', params[:classe][:id]])
       @atribuicao_classe = Atribuicao.find(:all, :joins => :disciplina,:conditions =>['classe_id = ? AND ativo=?', params[:classe][:id],0], :order =>'disciplinas.ordem ASC ' )
       classeAEE = @classe[0].classe_classe[0,3]


       if classeAEE == 'AEE'
         @matriculas = AtendimentoAee.find(:all,:conditions =>['classe_id = ?', params[:classe][:id]])
         session[:AEE]=1
       else
        @matriculas = Matricula.find(:all,:conditions =>['classe_id = ?', params[:classe][:id]], :order => 'classe_num ASC')
---
SELECT * FROM `disciplinas` WHERE (`disciplinas`.`id` = 26)
SELECT `atribuicaos`.* FROM `atribuicaos` INNER JOIN `disciplinas` ON `disciplinas`.id = `atribuicaos`.disciplina_id WHERE (classe_id = '2272' AND ativo=0) ORDER BY disciplinas.ordem ASC
SELECT * FROM `matriculas` WHERE (classe_id = '2272') ORDER BY classe_num ASC

 def load_classes
   @ano =   Classe.find(:all,:select => 'distinct(classe_ano_letivo) as ano',:order => 'classe_ano_letivo ASC')
   if current_user.unidade_id == 53 or current_user.unidade_id == 52
        #@classe = Classe.find(:all, :order => 'classe_classe ASC')
        @classe = Classe.find(:all, :joins => "INNER JOIN  unidades  ON  unidades.id = classes.unidade_id",:select => "classes.id, CONCAT(classes.classe_classe, ' - ',unidades.nome) AS classe_classe", :conditions => ['classes.classe_ano_letivo = ? AND classes.sala !=52', Time.now.year  ], :order => 'classes.classe_classe ASC')
---
SELECT * FROM `classes` WHERE (unidade_id = 14 and classe_ano_letivo = 2019 ) ORDER BY classe_classe ASC
SELECT * FROM `unidades` WHERE (`unidades`.`id` = 14)