app/controllers/faltasalunos_controller.rb

SELECT * FROM `professors` WHERE (id = 1197 AND desligado = 0) ORDER BY nome ASC
SELECT distinct(classes.id), (classe_classe) as classe_unidade FROM `classes` INNER JOIN atribuicaos ON classes.id = atribuicaos.classe_id WHERE (classes.classe_ano_letivo = 2021 AND atribuicaos.professor_id = 1197 and classes.unidade_id = 46) ORDER BY classes.classe_classe ASC
SELECT distinct(unidades.id), nome FROM `unidades` INNER JOIN users ON unidades.id = users.unidade_id WHERE (desativada = 0 and (tipo_id = 1 or tipo_id = 4 or tipo_id = 7) and users.unidade_id=46) ORDER BY nome ASC
SELECT * FROM `roles` INNER JOIN `roles_users` ON `roles`.id = `roles_users`.role_id WHERE (`roles_users`.user_id = 2 )
---
    def load_dados_iniciais
        if current_user.has_role?('admin') or current_user.has_role?('SEDUC')
            @pedagogos = Professor.find(:all, :select => 'distinct(professors.nome) as nome, professors.id as id ',:joins=> 'INNER JOIN atribuicaos ON atribuicaos.professor_id = professors.id INNER JOIN classes ON atribuicaos.classe_id = classes.id',:conditions => ['desligado = 0 AND (classes.classe_classe="PEDAGOGO" OR classes.classe_classe="COORDENAÇÃO" OR classes.classe_classe="SUPERVISÃO"  OR classes.classe_classe="COORDENAÇÃO" OR classes.classe_classe="DIREÇÃO FUNDAMENTAL" OR classes.classe_classe="DIREÇÃO INFANTIL")'],:order => 'nome ASC')
            @professor_unidade = Professor.find(:all, :conditions => ['desligado = 0'],:order => 'nome ASC')
            @classe_ano = Classe.find(:all, :joins => "INNER JOIN  unidades  ON  unidades.id = classes.unidade_id",:select => "classes.id, CONCAT(classes.classe_classe, ' - ',unidades.nome) AS classe_unidade", :conditions => ['classes.classe_ano_letivo = ?' , Time.now.year ], :order => 'classes.classe_classe ASC')
            @unidades = Unidade.find(:all,  :conditions => ['desativada = 0 and (tipo_id = 1 or tipo_id = 2 or tipo_id = 3 or tipo_id = 4 or  tipo_id = 5  or tipo_id = 7 or tipo_id = 8)'  ], :order => 'nome ASC')
        else if current_user.has_role?('direcao_fundamental')  or current_user.has_role?('pedagogo')or current_user.has_role?('supervisao')or current_user.has_role?('direcao_infantil')
                @professor_unidade = Professor.find(:all,:select => "distinct(professors.nome), professors.id", :joins => "INNER JOIN  atribuicaos   ON  professors.id = atribuicaos.professor_id INNER JOIN  classes   ON  classes.id = atribuicaos.classe_id ", :conditions => ['classes.unidade_id = ?  AND professors.desligado = 0 and atribuicaos.ano_letivo =?', current_user.unidade_id, Time.now.year],:order => 'nome ASC')

SELECT alunos.id , CONCAT(alunos.aluno_nome, ' | ',date_format(alunos.aluno_nascimento, '%d/%m/%Y')) AS aluno_nome_dtn , matriculas.classe_num as numero FROM `alunos` INNER JOIN matriculas on alunos.id = matriculas.aluno_id WHERE (matriculas.classe_id = '3523' AND matriculas.ano_letivo =2021 and ( aluno_status != 'EGRESSO' or aluno_status is null OR aluno_status = 'ABANDONO') AND alunos.unidade_id = 46) ORDER BY classe_num ASC
---
 def alunos
    a=session[:classe_id]= params[:classe_id]
  #  a1=   session[:professor_id]=params[:professor_id]

  # a2=session[:data]= params[:data]
    t=0
       @classe = Classe.find(:all,:conditions =>['id = ?', session[:classe_id]])
      classeAEE = @classe[0].classe_classe[0,3]
       if classeAEE == 'AEE'
         @alunos_matriculados = Aluno.find(:all, :joins =>[:atendimento_aee], :select => "alunos.id , CONCAT(alunos.aluno_nome, ' | ',date_format(alunos.aluno_nascimento, '%d/%m/%Y')) AS aluno_nome_dtn  "  , :joins => "INNER JOIN atendimento_aees on alunos.id = atendimento_aees.aluno_id", :conditions => ["atendimento_aees.classe_id = ? AND atendimento_aees.ano_letivo =? and ( aluno_status != 'EGRESSO' or aluno_status is null OR aluno_status = 'ABANDONO') AND alunos.unidade_id = ? ", session[:classe_id], Time.now.year , current_user.unidade_id ] )

SELECT * FROM `alunos` WHERE (`alunos`.`id` IN (12545,13206)) ORDER BY aluno_nome ASC
SELECT * FROM `atribuicaos` WHERE (professor_id ='1197' and ano_letivo=2021 and classe_id='3523' and disciplina_id ='1')
SELECT * FROM `matriculas` WHERE (aluno_id=12545 and classe_id='3523')
---
 def alunos_faltas_falta


     @alunos_faltaram=  Aluno.find(params[:aluno_ids], :order => 'aluno_nome ASC')
      w1=session[:professor_id]
      w2=session[:classe_id]
      w3=session[:disciplina_id]
     @atribuicao = Atribuicao.find(:all, :conditions => ["professor_id =? and ano_letivo=? and classe_id=? and disciplina_id =?", session[:professor_id], Time.now.year , session[:classe_id], session[:disciplina_id]])
     t=0
     if @atribuicao.empty?
        respond_to do |format|
                    #flash[:notice] = 'CADASTRADO COM SUCESSO.'
                    format.html { redirect_to(aviso_faltasalunos_path) }
                    format.xml  { head :ok }
                end
     else

     for aluno in @alunos_faltaram
          @faltasaluno = Faltasaluno.new
           @matricula= Matricula.find(:all, :conditions=> ['aluno_id=? and classe_id=?', aluno.id, session[:classe_id]])   # precisa também verificar o estado da matricula

INSERT INTO `faltasalunos` (`ativo`, `professor_id`, `conteudo`, `obs`, `user_id`, `faltas`, `created_at`, `atribuicao_id`, `updated_at`, `data`, `matricula_id`, `disciplina_id`, `ano_letivo`, `aluno_id`, `classe_id`, `unidade_id`) VALUES(0, 1197, NULL, NULL, 2, 2, '2021-06-25 12:51:59', 15908, '2021-06-25 12:51:59', '2021-06-25', 81867, 1, 2021, 12545, 3523, 46)
---
           @faltasaluno.faltas=session[:falta]
           #@faltasaluno.faltas=1
           @faltasaluno.obs=session[:obser]
           @faltasaluno.save

SELECT distinct(disciplinas.disciplina), disciplinas.id FROM `disciplinas` INNER JOIN atribuicaos ON disciplinas.id = atribuicaos.disciplina_id WHERE (atribuicaos.classe_id ='3523')
---
    def classe_disciplina
       params[:classe_id]
       @disciplina_classe = Disciplina.find(:all, :select=> 'distinct(disciplinas.disciplina), disciplinas.id',  :joins=> "INNER JOIN atribuicaos ON disciplinas.id = atribuicaos.disciplina_id", :conditions=> ['atribuicaos.classe_id =?', params[:classe_id]])

SELECT `faltasalunos`.* FROM `faltasalunos` INNER JOIN `classes` ON `classes`.id = `faltasalunos`.classe_id WHERE (data >='2021-06-23' AND data <='2021-06-25' AND classe_id = '3523' AND disciplina_id='1' AND professor_id=1197) ORDER BY classe_id ASC
SELECT alunos.id , matriculas.classe_num , alunos.aluno_nome	 ,CONCAT(alunos.aluno_nome, ' | ',date_format(alunos.aluno_nascimento, '%d/%m/%Y')) AS aluno_nome_dtn , matriculas.classe_num as numero FROM `alunos` INNER JOIN matriculas on alunos.id = matriculas.aluno_id WHERE (matriculas.classe_id = '3523' AND matriculas.ano_letivo =2021 and ( aluno_status != 'EGRESSO' or aluno_status is null OR aluno_status = 'ABANDONO') AND alunos.unidade_id = 46) ORDER BY classe_num ASC
SELECT distinct(data) ,aluno_id, matricula_id, 	atribuicao_id, 	classe_id, 	professor_id, 	disciplina_id , ano_letivo, faltas FROM `faltasalunos` INNER JOIN `classes` ON `classes`.id = `faltasalunos`.classe_id WHERE (data >='2021-06-23' AND data <='2021-06-25' AND classe_id = '3523' AND disciplina_id='1' AND professor_id=1197 AND data='2021-06-25') ORDER BY classe_id ASC
---
def consulta_faltas
    if params[:type_of].to_i == 3    #NADA

    else if params[:type_of].to_i == 1   #data
        session[:cons_data]=1

        session[:dia_final]=params[:diaF]
        session[:mesF]=params[:mesF]
        w=session[:Ix]=params[:faltasaluno][:inicio]
        session[:dataI]=params[:faltasaluno][:inicio][6,4]+'-'+params[:faltasaluno][:inicio][3,2]+'-'+params[:faltasaluno][:inicio][0,2]
        session[:dataF]=params[:faltasaluno][:fim][6,4]+'-'+params[:faltasaluno][:fim][3,2]+'-'+params[:faltasaluno][:fim][0,2]
        session[:mes]=params[:faltasaluno][:fim][3,2]
        session[:anoI]=params[:faltasaluno][:inicio][6,4]
        session[:anoF]=params[:faltasaluno][:fim][6,4]

        #ATENÇÂO COM A DATA FINAL   VVVVVVVVVVVVV

        if (current_user.has_role?('admin') or current_user.has_role?('SEDUC') or current_user.has_role?('supervisao') or current_user.has_role?('pedagogo'))
            #@conteudos = Conteudo.find(:all, :conditions =>  ["inicio >=? AND (fim <=?)   AND ano_letivo = ?", session[:dataI], session[:dataF], Time.now.year], :order => 'inicio DESC, classe_id ASC')
            @faltasalunos = Faltasaluno.find(:all,:joins =>[:professor, :classe], :conditions =>  ["inicio >=? AND (fim <=?) ", session[:dataI], session[:dataF]],  :order => 'professors.nome ASC, inicio DESC, classe_id ASC' )
             @faltasalunosdias = Faltasaluno.find(:all, :select=> 'distinct(data)'    ,:joins =>[:professor, :classe], :conditions =>  ["inicio >=? AND (fim <=?) ", session[:dataI], session[:dataF]],  :order => 'professors.nome ASC, inicio DESC, classe_id ASC' )