app/controllers/matriculas_controller.rb

  def edit
    @matricula = Matricula.find(params[:id])
---
SELECT * FROM `matriculas` WHERE (`matriculas`.`id` = 85105)

def alteracao_matricula
       session[:aluno_id]=params[:aluno][:id]
       @matriculas = Matricula.find(:all,:conditions =>['aluno_id = ?', params[:aluno][:id]], :order => 'classe_num ASC')
---
SELECT * FROM `alunos` WHERE (`alunos`.`id` = 29636)
SELECT * FROM `matriculas` WHERE (aluno_id = '29636') ORDER BY classe_num ASC

  def load_dados_iniciais
       unidade=  current_user.unidade_id
       @status= SituacaoAluno.find(:all)
       #@status_transf = SituacaoAluno.find(:all,:conditions =>['id != 3 AND id != 4'])
       @status_transf = SituacaoAluno.find(:all)
       @status_saida= SituacaoAluno.find(:all,:conditions =>['id = 2'])
       if (current_user.unidade_id > 41  and  current_user.unidade_id < 52)
         @unidade_procedencia1 = Unidade.find(:all,:conditions =>['id > 41 AND id <52'], :order => 'nome ASC')
         @unidade_procedencia = Unidade.find(:all,:conditions =>['id = ?', current_user.unidade_id], :order => 'nome ASC')
       else
         @unidade_procedencia1 = Unidade.find(:all,:conditions =>['id < 41  OR id >51'], :order => 'nome ASC')
         @unidade_procedencia = Unidade.find(:all, :order => 'nome ASC')
       end

       #@alunos = Aluno.find(:all, :conditions => ['aluno_status is null'],:order => 'aluno_nome')
       #@alunos1 = Aluno.find_by_sql("SELECT * FROM alunos  WHERE unidade_id= "+unidade.to_s+" AND`id` NOT IN
       #                (SELECT matriculas.aluno_id FROM matriculas INNER JOIN alunos ON alunos.id = matriculas.aluno_id WHERE matriculas.ano_letivo = "+(Time.now.year).to_s+" AND matriculas.status <> 'TRANSFERIDO' AND alunos.unidade_id = "+unidade.to_s+") AND aluno_status  is null
       #                 ORDER BY aluno_nome ASC")

       #@alunos2 = Aluno.find(:all, :conditions =>['unidade_id=? AND aluno_status is null', current_user.unidade_id],:order => 'aluno_nome')
       @alunos3 = Aluno.find(:all, :select =>"alunos.id, alunos.aluno_nome", :joins => "INNER JOIN matriculas ON alunos.id = matriculas.aluno_id", :conditions =>['alunos.unidade_id=? AND (matriculas.status = "MATRICULADO" OR matriculas.status = "*REMANEJADO" OR matriculas.status = "TRANSFERENCIA") AND  matriculas.ano_letivo =?', current_user.unidade_id, Time.now.year],:order => 'alunos.aluno_nome')
---
SELECT * FROM `alunos` WHERE (`alunos`.`id` = 29636)
SELECT * FROM `situacao_alunos` WHERE (id >= 6)
SELECT * FROM `unidades` WHERE (((id <= 41 OR id >51) AND id <> 62) AND id != 29 ) ORDER BY nome ASC
SELECT alunos.id, CONCAT(alunos.aluno_nome, ' | ',date_format(alunos.aluno_nascimento, '%d/%m/%Y')) AS aluno_nome_dtn FROM `alunos` INNER JOIN matriculas ON alunos.id = matriculas.aluno_id WHERE (alunos.unidade_id=29 AND (matriculas.status = "MATRICULADO" OR matriculas.status = "*REMANEJADO" OR matriculas.status = "TRANSFERENCIA") AND matriculas.ano_letivo =2021) ORDER BY alunos.aluno_nome