app/controllers/professors_controller.rb

   def load_classes
     @ano =   Classe.find(:all,:select => 'distinct(classe_ano_letivo) as ano',:order => 'classe_ano_letivo ASC')
     @disciplinas = Disciplina.find(:all, :select => 'id, disciplina', :conditions => ["curriculo = 'B' OR curriculo = 'D'"], :order => 'disciplina ASC')
   if current_user.unidade_id == 53 or current_user.unidade_id == 52
        @classes = Classe.find(:all, :order => 'classe_classe ASC')
        @classes_todas = Classe.find(:all, :order => 'classe_ano_letivo ASC, classe_classe ASC')

    else
        @classes = Classe.find(:all, :conditions => ['unidade_id = ? and classe_ano_letivo = ? ', current_user.unidade_id, Time.now.year  ], :order => 'classe_classe ASC')
---
SELECT id, disciplina FROM `disciplinas` WHERE (curriculo = 'B' OR curriculo = 'D') ORDER BY disciplina ASC
SELECT * FROM `unidades` WHERE (`unidades`.`id` = 42)

  def load_professors
    if (current_user.unidade_id == 53 or current_user.unidade_id == 52 ) then
      @professors = Professor.find(:all, :conditions => 'desligado = 0' , :order => 'nome ASC')
---
SELECT * FROM `professors` WHERE (desligado = 0 AND (diversas_unidades =1 OR	unidade_id=50)) ORDER BY matricula ASC