app/controllers/relatorios_controller.rb

  def show
    @relatorio = Relatorio.find(params[:id])
    @classe = Atribuicao.find(:all, :joins => :disciplina, :select=> 'classe_id, disciplinas.disciplina AS disc', :conditions => ['atribuicaos.id=? ', @relatorio.atribuicao_id])
    @professors = Professor.find(:all, :select => 'nome', :joins => "INNER JOIN atribuicaos ON professors.id = atribuicaos.professor_id INNER JOIN classes ON classes.id = atribuicaos.classe_id", :conditions => ['atribuicaos.classe_id=?', @classe[0].classe_id])
---
SELECT * FROM `relatorios` WHERE (`relatorios`.`id` = 9802)
SELECT * FROM `disciplinas` WHERE (curriculo ='I' and ano_letivo =2019 ) ORDER BY disciplina
SELECT classe_id, disciplinas.disciplina AS disc FROM `atribuicaos` INNER JOIN `disciplinas` ON `disciplinas`.id = `atribuicaos`.disciplina_id WHERE (atribuicaos.id=6816 )
SELECT * FROM `classes` WHERE (`classes`.`id` = 2147)
SELECT nome FROM `professors` INNER JOIN atribuicaos ON professors.id = atribuicaos.professor_id INNER JOIN classes ON classes.id = atribuicaos.classe_id WHERE (atribuicaos.classe_id=2147)

  def edit
    @relatorio = Relatorio.find(params[:id])

###Alex 28/06/19 - @classe = Atribuicao.find(:all, :select=> 'classe_id', :conditions => ['id=? ', @relatorio.atribuicao_id] )
    @classe = Atribuicao.find(:all, :joins => :disciplina, :select=> 'classe_id, disciplinas.disciplina AS disc', :conditions => ['atribuicaos.id=? ', @relatorio.atribuicao_id])
    #@professors = Professor.find(:all, :select => 'nome', :joins => "INNER JOIN atribuicaos ON professors.id = atribuicaos.professor_id INNER JOIN classes ON classes.id = atribuicaos.classe_id", :conditions => ['atribuicaos.classe_id=?', @classe[0].classe_id])
    @professors = Professor.find(:all, :select => 'nome', :joins => "INNER JOIN relatorios ON professors.id = relatorios.professor_id", :conditions => ['relatorios.id=?', params[:id]])
---
SELECT * FROM `relatorios` WHERE (`relatorios`.`id` = 9802)
SELECT * FROM `disciplinas` WHERE (curriculo ='I' and ano_letivo =2019 ) ORDER BY disciplina
SELECT classe_id, disciplinas.disciplina AS disc FROM `atribuicaos` INNER JOIN `disciplinas` ON `disciplinas`.id = `atribuicaos`.disciplina_id WHERE (atribuicaos.id=8311 )
SELECT nome FROM `professors` INNER JOIN relatorios ON professors.id = relatorios.professor_id WHERE (relatorios.id='9802')

  def create
    @relatorio = Relatorio.new(params[:relatorio])
    @relatorio.ano_letivo =  Time.now.year

    @relatorio.professor_id = session[:professor_id]
    @atribuicao = Atribuicao.find(:all, :conditions => ["professor_id =? and ano_letivo=?", session[:professor_id], Time.now.year ])
    @relatorio.atribuicao_id= @atribuicao[0].id
    session[:poraluno] = 1
    session[:aluno_imp]= @relatorio.aluno_id

    respond_to do |format|
      if @relatorio.save
---
SELECT * FROM `atribuicaos` WHERE (professor_id ='169' and ano_letivo=2019)
INSERT INTO `relatorios` (`aluno_id`, `ano_letivo`, `observacao`, `faltas`, `profissional`, `created_at`, `updated_at`, `professor_id`, `atribuicao_id`, `dias_letivos`, `frequencia`) VALUES(2678, 2019, 'teste 97 x 4', 4, NULL, '2019-06-26 15:54:09', '2019-06-26 15:54:09', 169, 10047, 97, 100.0)

            @relatorio.frequencia=100-((session[:faltas].to_f/session[:aulas].to_f)*100)
          end
        end
        @relatorio.save
---
UPDATE `relatorios` SET `updated_at` = '2019-06-26 15:08:50', `faltas` = 0, `frequencia` = 0.0 WHERE `id` = 9804

  def update
      @relatorio = Relatorio.find(params[:id])
      session[:faltas]=@relatorio.faltas
      session[:aulas]=@relatorio.dias_letivos
      if @relatorio.dias_letivos == 0
          session[:faltas]=0
          @relatorio.faltas=0
          @relatorio.frequencia=0
      else
          session[:aulas]=@relatorio.dias_letivos
          if @relatorio.faltas == 0
              @relatorio.frequencia=100
          else
              @relatorio.frequencia = 100-((session[:faltas].to_f / session[:aulas].to_f)*100)
          end
      end

      respond_to do |format|
          if @relatorio.update_attributes(params[:relatorio])
---
SELECT * FROM `relatorios` WHERE (`relatorios`.`id` = 9802)
UPDATE `relatorios` SET `updated_at` = '2019-06-26 15:15:20', `faltas` = 5, `dias_letivos` = 50 WHERE `id` = 9802

  def destroy
    @relatorio = Relatorio.find(params[:id])
    @relatorio.destroy
---
SELECT * FROM `relatorios` WHERE (`relatorios`.`id` = 7868)
DELETE FROM `relatorios` WHERE `id` = 7868

  def professor
    session[:professor_id]=params[:relatorio_professor_id]
    @atribuicao = Atribuicao.find(:all, :conditions => ["professor_id =? and ano_letivo=?", session[:professor_id], Time.now.year ])
    cont_cl=0
    for atribuicao in @atribuicao
        @aluno= Matricula.find(:all, :select => 'alunos.id, alunos.aluno_nome',:joins =>:aluno  ,:conditions=>['matriculas.classe_id=? AND (matriculas.status ="MATRICULADO" OR matriculas.status ="TRANSFERENCIA" OR matriculas.status ="*REMANEJADO")', atribuicao.classe_id ], :order => 'alunos.aluno_nome ASC')
---
SELECT * FROM `atribuicaos` WHERE (professor_id ='753' and ano_letivo=2019)
SELECT alunos.id, alunos.aluno_nome FROM `alunos` INNER JOIN matriculas ON alunos.id = matriculas.aluno_id INNER JOIN classes ON classes.id = matriculas.classe_id INNER JOIN atribuicaos ON classes.id = atribuicaos.classe_id WHERE (alunos.unidade_id=14 AND alunos.aluno_status is null AND atribuicaos.professor_id =753) ORDER BY alunos.aluno_nome
SELECT alunos.id, alunos.aluno_nome FROM `matriculas` INNER JOIN `alunos` ON `alunos`.id = `matriculas`.aluno_id WHERE (matriculas.classe_id=2272 AND (matriculas.status ="MATRICULADO" OR matriculas.status ="TRANSFERENCIA" OR matriculas.status ="*REMANEJADO")) ORDER BY alunos.aluno_nome ASC

  def fapea_ano
      if current_user.has_role?('admin') or current_user.has_role?('pedagogo') or current_user.has_role?('direcao_infantil') or current_user.has_role?('SEDUC') or current_user.has_role?('direcao_fudamental') or current_user.has_role?('supervisao')
        @fapea_ano = Relatorio.find(:all, :joins => :aluno, :conditions=> ['ano_letivo =? and alunos.unidade_id=?' , params[:ano_letivo], current_user.unidade_id])
        ###Alex - mudei no SQL de cima para puxar só da unidade, para diminuir a lista neste momento - AlexML - 25/06/19 12:11 - @fapea_ano = Relatorio.find(:all, :conditions=> ['ano_letivo =?' , params[:ano_letivo]])
        @alunosRel = Relatorio.find(:all, :select => 'distinct(alunos.aluno_nome), alunos.id', :joins => :aluno,  :conditions =>['alunos.aluno_status is null AND ano_letivo=?', params[:ano_letivo] ],:order => 'alunos.aluno_nome ASC')
---
SELECT * FROM `roles` INNER JOIN `roles_users` ON `roles`.id = `roles_users`.role_id WHERE (`roles_users`.user_id = 3 )
SELECT * FROM `unidades` WHERE (id < 40 OR id >51) ORDER BY nome ASC
SELECT `relatorios`.* FROM `relatorios` INNER JOIN `alunos` ON `alunos`.id = `relatorios`.aluno_id WHERE (ano_letivo ='2019' and alunos.unidade_id=57)
SELECT alunos.id, alunos.aluno_nome FROM `alunos` INNER JOIN matriculas ON alunos.id = matriculas.aluno_id INNER JOIN classes ON classes.id = matriculas.classe_id INNER JOIN atribuicaos ON classes.id = atribuicaos.classe_id WHERE (alunos.unidade_id=57 AND alunos.aluno_status is null AND atribuicaos.professor_id =753) ORDER BY alunos.aluno_nome
SELECT distinct(alunos.aluno_nome), alunos.id FROM `relatorios` INNER JOIN `professors` ON `professors`.id = `relatorios`.professor_id INNER JOIN `alunos` ON `alunos`.id = `relatorios`.aluno_id WHERE (alunos.unidade_id=4 AND alunos.aluno_status is null AND relatorios.professor_id =753) ORDER BY alunos.aluno_nome

def consulta_fapea

    if params[:type_of].to_i == 3

            session[:aluno_imp]= params[:aluno_fapea]
            session[:ano_imp]=params[:ano_letivo]
            session[:impressao]= 1
            session[:tipo]=0
            @relatorios = Relatorio.find(:all, :conditions => ["aluno_id =?  and ano_letivo=?", params[:aluno_fapea], Time.now.year])
            #@matricula = Matricula.find(:all, :conditions => ["aluno_id =? and ano_letivo =?", params[:aluno], Time.now.year], :order => ["id DESC"])
            @matricula = Matricula.find(:all, :conditions => ["aluno_id =? and ano_letivo =?", params[:aluno_fapea], Time.now.year], :order => ["id DESC"])
            ###Alex 26/06/2019 10:27 - Com os PAs deu problema puxou todos porque o ID da classe é 0 - @classe = Atribuicao.find(:all, :select=> 'classe_id', :conditions => ['id=? ', @relatorios[0].atribuicao_id] )
            @classe = Atribuicao.find(:all, :joins => [:classe, :disciplina], :select=> 'atribuicaos.classe_id, classes.classe_classe, disciplinas.disciplina AS disc', :conditions => ['classe_id=?', @matricula[0].classe_id] )
            ###Alex 26/06/2019 10:20 - Não sei para que é estou comentando - @classe[0].classe_id
            @professors = Professor.find(:all, :select => 'nome', :joins => "INNER JOIN atribuicaos ON professors.id = atribuicaos.professor_id INNER JOIN classes ON classes.id = atribuicaos.classe_id", :conditions => ['atribuicaos.classe_id=?', @classe[0].classe_id])
---
SELECT * FROM `relatorios` WHERE (aluno_id ='23164' and ano_letivo =2019)
SELECT * FROM `matriculas` WHERE (aluno_id ='9133' and ano_letivo ='2019') ORDER BY id DESC
SELECT * FROM `classes` WHERE (`classes`.`id` = 2401)
SELECT * FROM `disciplinas` WHERE (curriculo ='I' and ano_letivo =2019 ) ORDER BY disciplina
SELECT disciplinas.curriculo, disciplinas.disciplina AS disc, atribuicaos.classe_id, classes.classe_classe FROM `atribuicaos` INNER JOIN `disciplinas` ON `disciplinas`.id = `atribuicaos`.disciplina_id INNER JOIN `classes` ON `classes`.id = `atribuicaos`.classe_id WHERE (classe_id=2013)
SELECT nome FROM `professors` INNER JOIN atribuicaos ON professors.id = atribuicaos.professor_id INNER JOIN classes ON classes.id = atribuicaos.classe_id WHERE (atribuicaos.classe_id=2401)

                  session[:aluno_imp]
                  session[:ano_imp]=params[:ano_letivo]
                  session[:tipo]=0
                  @relatorios = Relatorio.find(:all, :conditions => ["aluno_id =? and ano_letivo =?", params[:aluno], Time.now.year])

                  @matricula = Matricula.find(:all, :conditions => ["aluno_id =? and ano_letivo =?", params[:aluno], Time.now.year], :order => ["id DESC"])
                  ###Alex 26/06/2019 10:27 - Com os PAs deu problema puxou todos porque o ID da classe é 0 - @classe = Atribuicao.find(:all, :select=> 'classe_id', :conditions => ['id=? AND ano_letivo = ? ', @relatorios[0].atribuicao_id, Time.now.year] )
                  @classe = Atribuicao.find(:all, :joins => [:classe, :disciplina], :select=> 'atribuicaos.classe_id, classes.classe_classe, disciplinas.disciplina AS disc', :conditions => ['classe_id=?', @matricula[0].classe_id])
---
SELECT * FROM `alunos` WHERE (`alunos`.`id` = 23164)
SELECT alunos.id, alunos.aluno_nome FROM `alunos` INNER JOIN matriculas ON alunos.id = matriculas.aluno_id INNER JOIN classes ON classes.id = matriculas.classe_id INNER JOIN atribuicaos ON classes.id = atribuicaos.classe_id WHERE (alunos.unidade_id=57 AND alunos.aluno_status is null AND atribuicaos.professor_id =753) ORDER BY alunos.aluno_nome

 def impressao_fapea

            @relatorio = Relatorio.find(:all, :conditions => ["id =?", params[:id]])
##            @relatorio = Relatorio.find(:last, :conditions => ["aluno_id =?", session[:aluno_imp]])
            if session[:tipo]==1
                 @matricula = Matricula.find(:all, :conditions => ["aluno_id =? and ano_letivo =?", session[:aluno_imp], session[:ano_imp]], :order => ["id DESC"])
            else

                @matricula = Matricula.find(:all, :conditions => ["aluno_id =? and ano_letivo =?", session[:aluno_imp], Time.now.year], :order => ["id DESC"])
                session[:tipo]=0
            end
            session[:relatorio_id]=params[:id]
            ###Alex 26/06/2019 10:27 - Com os PAs deu problema puxou todos porque o ID da classe é 0 - @classe = Atribuicao.find(:all, :select=> 'classe_id', :conditions => ['id=? AND ano_letivo = ? ', @relatorio.atribuicao_id, Time.now.year] )
            @classe = Atribuicao.find(:all, :joins => [:classe, :disciplina], :select=> 'atribuicaos.classe_id, classes.classe_classe, disciplinas.disciplina AS disc', :conditions => ['classe_id=?', @matricula[0].classe_id] )
            @professors = Professor.find(:all, :select => 'nome', :joins => "INNER JOIN relatorios ON professors.id = relatorios.professor_id", :conditions => ['relatorios.id=?', session[:relatorio_id]])
---
SELECT * FROM `relatorios` WHERE (aluno_id =2483) ORDER BY relatorios.id DESC LIMIT 1
SELECT * FROM `matriculas` WHERE (aluno_id =NULL and ano_letivo =NULL) ORDER BY id DESC
SELECT * FROM `classes` WHERE (`classes`.`id` = 0)
SELECT * FROM `disciplinas` WHERE (curriculo ='I' and ano_letivo =2019 ) ORDER BY disciplina
SELECT atribuicaos.classe_id, classes.classe_classe, disciplinas.disciplina AS disc FROM `atribuicaos` INNER JOIN `classes` ON `classes`.id = `atribuicaos`.classe_id INNER JOIN `disciplinas` ON `disciplinas`.id = `atribuicaos`.disciplina_id WHERE (classe_id=2013)
SELECT nome FROM `professors` INNER JOIN atribuicaos ON professors.id = atribuicaos.professor_id INNER JOIN classes ON classes.id = atribuicaos.classe_id WHERE (atribuicaos.classe_id=0)

  def impressao_fapeaT
      @matriculas = Matricula.find(:all,:conditions =>['classe_id = ?',session[:classe_id]], :order => 'classe_num ASC')
      @classe = Atribuicao.find(:all, :joins => [:classe, :disciplina], :select=> 'atribuicaos.classe_id, classes.classe_classe, disciplinas.disciplina AS disc', :conditions => ['classe_id=?', @matriculas[0].classe_id])
      @professors = Professor.find(:all, :select => 'nome', :joins => "INNER JOIN atribuicaos ON professors.id = atribuicaos.professor_id INNER JOIN classes ON classes.id = atribuicaos.classe_id", :conditions => ['atribuicaos.classe_id=?', @classe[0].classe_id])
---
SELECT * FROM `matriculas` WHERE (classe_id = NULL) ORDER BY classe_num ASC
SELECT * FROM `classes` WHERE (`classes`.`id` = 2035)
SELECT * FROM `disciplinas` WHERE (curriculo ='I' and ano_letivo =2019 ) ORDER BY disciplina
SELECT atribuicaos.classe_id, classes.classe_classe, disciplinas.disciplina AS disc FROM `atribuicaos` INNER JOIN `classes` ON `classes`.id = `atribuicaos`.classe_id INNER JOIN `disciplinas` ON `disciplinas`.id = `atribuicaos`.disciplina_id WHERE (classe_id=2035)
SELECT nome FROM `professors` INNER JOIN atribuicaos ON professors.id = atribuicaos.professor_id INNER JOIN classes ON classes.id = atribuicaos.classe_id WHERE (atribuicaos.classe_id=2035)

def editar

    if params[:type_of].to_i == 3
        if ( params[:aluno_fapea].present?)
            session[:aluno_imp]= params[:aluno_fapea]
            session[:ano_imp]=params[:ano_letivo]
            session[:impressao]= 1
                  @relatorios = Relatorio.find(:all, :conditions => ["aluno_id =?", params[:aluno_fapea]])
                  @matricula = Matricula.find(:all, :conditions => ["aluno_id =? and ano_letivo =?", params[:aluno_fapea], Time.now.year], :order => ["id DESC"])
                  ###Alex 26/06/2019 10:27 - Com os PAs deu problema puxou todos porque o ID da classe é 0 - @classe = Atribuicao.find(:all, :select=> 'classe_id', :conditions => ['id=? AND ano_letivo = ? ', @relatorios[0].atribuicao_id, Time.now.year] )
                  @classe = Atribuicao.find(:all, :joins => [:classe, :disciplina], :select=> 'atribuicaos.classe_id, classes.classe_classe, disciplinas.disciplina AS disc', :conditions => ['classe_id=?', @matricula[0].classe_id] )
                  ###Alex 26/06/2019 10:20 - Não sei para que é estou comentando - @classe[0].classe_id
                  @professors = Professor.find(:all, :select => 'professors.nome, professors.id', :joins => "INNER JOIN atribuicaos ON professors.id = atribuicaos.professor_id INNER JOIN classes ON classes.id = atribuicaos.classe_id", :conditions => ['atribuicaos.classe_id=?', @classe[0].classe_id])
---
SELECT * FROM `relatorios` WHERE (aluno_id ='2481' and ano_letivo ='2019')
SELECT * FROM `matriculas` WHERE (aluno_id ='6476' and ano_letivo ='2019') ORDER BY id DESC
SELECT * FROM `classes` WHERE (`classes`.`id` = 2147)
SELECT * FROM `disciplinas` WHERE (curriculo ='I' and ano_letivo =2019 ) ORDER BY disciplina
SELECT atribuicaos.classe_id, classes.classe_classe, disciplinas.disciplina AS disc FROM `atribuicaos` INNER JOIN `classes` ON `classes`.id = `atribuicaos`.classe_id INNER JOIN `disciplinas` ON `disciplinas`.id = `atribuicaos`.disciplina_id WHERE (classe_id=2013)
SELECT professors.nome, professors.id FROM `professors` INNER JOIN atribuicaos ON professors.id = atribuicaos.professor_id INNER JOIN classes ON classes.id = atribuicaos.classe_id WHERE (atribuicaos.classe_id=2013)

                 if ( params[:aluno].present?)
                  session[:aluno_imp]= params[:aluno]
                  session[:ano_imp]=params[:ano_letivo]
                  @relatorios = Relatorio.find(:all, :conditions => ["aluno_id =? and ano_letivo =?", params[:aluno], params[:ano_letivo]])
---
SELECT * FROM `alunos` WHERE (`alunos`.`id` = 2481)

  def dados
    w=session[:professor_id]
    w1=params[:relatorio_aluno_id]
    @atribuicao = Atribuicao.find(:all, :conditions => ["professor_id =? AND ano_letivo=?", session[:professor_id],Time.now.year])
    @aluno = Aluno.find(:all, :conditions => ["id=?", params[:relatorio_aluno_id]])
---
SELECT * FROM `atribuicaos` WHERE (professor_id ='169' AND ano_letivo=2019)
SELECT * FROM `alunos` WHERE (id='2481')

  def load_dados_iniciais
       unidade=  current_user.unidade_id
       if (current_user.unidade_id > 41  and  current_user.unidade_id < 52)
         @unidade_procedencia1 = Unidade.find(:all,:conditions =>['id > 41 AND id <52'], :order => 'nome ASC')
         @unidade_procedencia = Unidade.find(:all,:conditions =>['id = ?', current_user.unidade_id], :order => 'nome ASC')
         @disciplinas= Disciplina.find(:all, :conditions =>['curriculo != "I" and ano_letivo =? ', (Time.now.year)], :order =>'disciplina'  )
       else
         #@alunosRel = Relatorio.find(:all, :select => 'alunos.id, alunos.aluno_nome', :joins => :aluno,  :conditions =>['alunos.unidade_id=? AND alunos.aluno_status is null', current_user.unidade_id ],:order => 'alunos.aluno_nome')
         @unidade_procedencia1 = Unidade.find(:all,:conditions =>['id < 40  OR id >51'], :order => 'nome ASC')
         @unidade_procedencia = Unidade.find(:all, :order => 'nome ASC')
         @disciplinas= Disciplina.find(:all, :conditions =>['curriculo =? and ano_letivo =? ', 'I', (Time.now.year)], :order =>'disciplina'  )
       end
       #@alunos = Aluno.find(:all, :conditions => ['aluno_status is null'],:order => 'aluno_nome')
       #@alunos1 = Aluno.find_by_sql("SELECT * FROM alunos  WHERE unidade_id= "+unidade.to_s+" AND`id` NOT IN
       #                (SELECT matriculas.aluno_id FROM matriculas INNER JOIN alunos ON alunos.id = matriculas.aluno_id WHERE matriculas.ano_letivo = "+(Time.now.year).to_s+" AND matriculas.status <> 'TRANSFERIDO' AND alunos.unidade_id = "+unidade.to_s+")
       #                 ORDER BY aluno_nome ASC")

       @alunos2 = Aluno.find(:all, :select => 'alunos.id, alunos.aluno_nome', :joins => "INNER JOIN matriculas ON alunos.id = matriculas.aluno_id INNER JOIN classes ON classes.id = matriculas.classe_id INNER JOIN atribuicaos ON classes.id = atribuicaos.classe_id", :conditions =>['alunos.unidade_id=? AND alunos.aluno_status is null AND atribuicaos.professor_id =?', current_user.unidade_id, current_user.professor_id ],:order => 'alunos.aluno_nome')       #@alunos3 = Aluno.find(:all, :joins => "INNER JOIN matriculas ON alunos.id = matriculas.aluno_id", :conditions =>['alunos.unidade_id=? AND (matriculas.status = "MATRICULADO" OR matriculas.status = "*REMANEJADO" OR matriculas.status = "TRANSFERENCIA")  ', current_user.unidade_id],:order => 'alunos.aluno_nome')


       if current_user.has_role?('admin') or current_user.has_role?('SEDUC') or current_user.has_role?('Supervisão')
          @professor_unidade = Professor.find(:all, :conditions => ['desligado = 0'],:order => 'nome ASC')
          @alunosRel = Relatorio.find(:all, :select => 'distinct(alunos.aluno_nome), alunos.id', :joins => :aluno,  :conditions =>['alunos.aluno_status is null'],:order => 'alunos.aluno_nome ASC')
       else if current_user.has_role?('professor_infantil')
             @professor_unidade = Professor.find(:all, :conditions => ['id = ?  AND desligado = 0', (current_user.professor_id)],:order => 'nome ASC')
---
SELECT * FROM `unidades` WHERE (id < 40 OR id >51) ORDER BY nome ASC
SELECT * FROM `disciplinas` WHERE (curriculo ='I' and ano_letivo =2019 ) ORDER BY disciplina
SELECT * FROM `classes` WHERE (classe_ano_letivo =2019 and unidade_id=57)
SELECT * FROM `professors` WHERE (unidade_id = 62 AND desligado = 0) ORDER BY nome ASC
SELECT alunos.id, alunos.aluno_nome FROM `alunos` INNER JOIN matriculas ON alunos.id = matriculas.aluno_id INNER JOIN classes ON classes.id = matriculas.classe_id INNER JOIN atribuicaos ON classes.id = atribuicaos.classe_id WHERE (alunos.unidade_id=62 AND alunos.aluno_status is null AND atribuicaos.professor_id =770) ORDER BY alunos.aluno_nome
SELECT distinct(alunos.aluno_nome), alunos.id FROM `relatorios` INNER JOIN `professors` ON `professors`.id = `relatorios`.professor_id INNER JOIN `alunos` ON `alunos`.id = `relatorios`.aluno_id WHERE (alunos.unidade_id=14 AND alunos.aluno_status is null AND relatorios.professor_id =753) ORDER BY alunos.aluno_nome
SELECT * FROM `roles` INNER JOIN `roles_users` ON `roles`.id = `roles_users`.role_id WHERE (`roles_users`.user_id = 3 )

  def load_consulta_ano
    @ano =   Relatorio.find(:all,:select => 'distinct(ano_letivo) as ano',:order => 'ano_letivo DESC')
    @ano1 =   Nota.find(:all,:select => 'distinct(ano_letivo) as ano',:order => 'ano_letivo DESC')
    @disciplina=  Disciplina.find(:all,:select => 'distinct(disciplina) as disciplina', :conditions => ['ano_letivo =? and tipo_un =?', Time.now.year, 3] ,:order => 'ano_letivo DESC')
---
SELECT distinct(disciplina) as disciplina FROM `disciplinas` WHERE (ano_letivo =2019 and tipo_un =3) ORDER BY ano_letivo DESC