app/controllers/roles_users_controller.rb

  def load_role
    if current_user.has_role?('admin')
        @roles = Role.find(:all)
    else if current_user.has_role?('direcao_infantil')
          @roles = Role.find(:all, :conditions => ['id = 10 or id = 12 or id = 6'])
         else if current_user.has_role?('direcao_fundamental')
                @roles = Role.find(:all, :conditions => ['id > 4 and id < 9'])
               else
              end
         end
    end
    @role_users = RolesUser.find(:all)
---
SELECT * FROM `roles` WHERE (id > 4 and id < 9)
SELECT * FROM `roles_users` WHERE (`roles_users`.`id` = 3)
SELECT * FROM `users` WHERE (`users`.`id` = 3) LIMIT 1

  def index
    $new_id = 0
   if current_user.unidade_id == 53 or current_user.unidade_id == 52
        @role_users = RolesUser.find(:all, :joins => :user, :order => 'login ASC')
    else
         @role_users = RolesUser.find(:all, :joins => :user,:conditions => ['users.unidade_id = ? ', current_user.unidade_id], :order => 'login ASC')
---
SELECT `roles_users`.* FROM `roles_users` INNER JOIN `users` ON `users`.id = `roles_users`.user_id WHERE (users.unidade_id = 4 AND users.activated_at is not null) ORDER BY login ASC
SELECT * FROM `unidades` WHERE (id=4)

  def update
    @role_user = RolesUser.find(params[:id])
    @role_user.role_id = $new_role_id
    respond_to do |format|
      if @role_user.update_attributes(params[:role_user])
---
UPDATE `roles_users` SET `role_id` = 4 WHERE `id` = 3