app/controllers/roles_users_controller.rb

SELECT * FROM `roles_users`
---
  def index
    $new_id = 0

    @role_users = RolesUser.paginate :page => params[:page], :per_page => 20, :joins => :user, :order => 'login ASC'