app/controllers/users_controller.rb

SELECT `users`.id FROM `users` WHERE (`users`.`login` = BINARY 'seduc.alex' AND `users`.id <> 3) LIMIT 1
---
  def load_users
    @users =User.find(:all, :order => 'login ASC')

UPDATE `users` SET `unidade_id` = 14, `updated_at` = '2019-06-24 13:57:50' WHERE `id` = 3
---
  def update
    @user = current_user
    respond_to do |format|
      if @user.update_attributes(params[:user])

SELECT * FROM `unidades` ORDER BY nome ASC
---
  def load_resources
    @unidades = Unidade.all